loadtests/scenarios/student-enrollment.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Student Enrollment Load Test">
      <stringProp name="TestPlan.comments">Load test for student enrollment API - 100 concurrent users, GET /Students and POST /Students/Create</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <!-- User Defined Variables for Azure Load Testing Integration -->
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Test Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="webapp_url" elementType="Argument">
            <stringProp name="Argument.name">webapp_url</stringProp>
            <stringProp name="Argument.value">${__P(webapp_url,localhost:5000)}</stringProp>
          </elementProp>
          <elementProp name="concurrent_users" elementType="Argument">
            <stringProp name="Argument.name">concurrent_users</stringProp>
            <stringProp name="Argument.value">${__P(concurrent_users,100)}</stringProp>
          </elementProp>
          <elementProp name="duration_seconds" elementType="Argument">
            <stringProp name="Argument.name">duration_seconds</stringProp>
            <stringProp name="Argument.value">${__P(duration_seconds,300)}</stringProp>
          </elementProp>
          <elementProp name="ramp_up_seconds" elementType="Argument">
            <stringProp name="Argument.name">ramp_up_seconds</stringProp>
            <stringProp name="Argument.value">${__P(ramp_up_seconds,60)}</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      
      <!-- Thread Group: 100 Concurrent Users -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Student Enrollment Users">
        <stringProp name="ThreadGroup.num_threads">${concurrent_users}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${ramp_up_seconds}</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${duration_seconds}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <!-- HTTP Cookie Manager for Session State -->
        <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="Cookie Manager">
          <boolProp name="CookieManager.clearEachIteration">false</boolProp>
          <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
        </CookieManager>
        <hashTree/>
        
        <!-- HTTP Header Manager -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Headers">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Accept" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8</stringProp>
            </elementProp>
            <elementProp name="Accept-Language" elementType="Header">
              <stringProp name="Header.name">Accept-Language</stringProp>
              <stringProp name="Header.value">en-US,en;q=0.5</stringProp>
            </elementProp>
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/x-www-form-urlencoded</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        
        <!-- HTTP Request Defaults -->
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
          <stringProp name="HTTPSampler.domain">${webapp_url}</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
        </ConfigTestElement>
        <hashTree/>

        <!-- ============================================================ -->
        <!-- Scenario 1: Browse Students (GET /Students) - 60% of traffic -->
        <!-- ============================================================ -->
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="TC_01_Browse_Students">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">true</boolProp>
        </TransactionController>
        <hashTree>
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /Students">
            <stringProp name="HTTPSampler.path">/Students</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <!-- Response Code Assertion -->
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert HTTP 200">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49586">200</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <intProp name="Assertion.test_type">8</intProp>
            </ResponseAssertion>
            <hashTree/>
            
            <!-- Duration Assertion: Response under 2 seconds -->
            <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Assert Response Time < 2s">
              <stringProp name="DurationAssertion.duration">2000</stringProp>
            </DurationAssertion>
            <hashTree/>
            
            <!-- Content Assertion -->
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert Students Content">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="1847946971">Students</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
              <intProp name="Assertion.test_type">2</intProp>
            </ResponseAssertion>
            <hashTree/>
          </hashTree>
          
          <!-- Realistic Think Time: 1-3 seconds -->
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Think Time">
            <stringProp name="ConstantTimer.delay">1000</stringProp>
            <stringProp name="RandomTimer.range">2000</stringProp>
          </UniformRandomTimer>
          <hashTree/>
        </hashTree>

        <!-- ============================================================ -->
        <!-- Scenario 2: Create Student (POST /Students/Create) - 40% of traffic -->
        <!-- ============================================================ -->
        <TransactionController guiclass="TransactionControllerGui" testclass="TransactionController" testname="TC_02_Create_Student">
          <boolProp name="TransactionController.includeTimers">false</boolProp>
          <boolProp name="TransactionController.parent">true</boolProp>
        </TransactionController>
        <hashTree>
          <!-- Step 1: GET the Create form (to get CSRF token if applicable) -->
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /Students/Create">
            <stringProp name="HTTPSampler.path">/Students/Create</stringProp>
            <stringProp name="HTTPSampler.method">GET</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          </HTTPSamplerProxy>
          <hashTree>
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert HTTP 200">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="49586">200</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <intProp name="Assertion.test_type">8</intProp>
            </ResponseAssertion>
            <hashTree/>
            
            <!-- Extract RequestVerificationToken for CSRF protection -->
            <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Extract CSRF Token">
              <stringProp name="RegexExtractor.useHeaders">false</stringProp>
              <stringProp name="RegexExtractor.refname">csrf_token</stringProp>
              <stringProp name="RegexExtractor.regex">name="__RequestVerificationToken" type="hidden" value="([^"]+)"</stringProp>
              <stringProp name="RegexExtractor.template">$1$</stringProp>
              <stringProp name="RegexExtractor.default">NO_TOKEN_FOUND</stringProp>
              <stringProp name="RegexExtractor.match_number">1</stringProp>
            </RegexExtractor>
            <hashTree/>
          </hashTree>
          
          <!-- Form fill think time -->
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Form Fill Time">
            <stringProp name="ConstantTimer.delay">2000</stringProp>
            <stringProp name="RandomTimer.range">3000</stringProp>
          </UniformRandomTimer>
          <hashTree/>
          
          <!-- Step 2: POST the Create form -->
          <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /Students/Create">
            <stringProp name="HTTPSampler.path">/Students/Create</stringProp>
            <stringProp name="HTTPSampler.method">POST</stringProp>
            <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
            <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
            <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
              <collectionProp name="Arguments.arguments">
                <elementProp name="__RequestVerificationToken" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">true</boolProp>
                  <stringProp name="Argument.name">__RequestVerificationToken</stringProp>
                  <stringProp name="Argument.value">${csrf_token}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="Student.LastName" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">true</boolProp>
                  <stringProp name="Argument.name">Student.LastName</stringProp>
                  <stringProp name="Argument.value">LoadTest${__threadNum}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="Student.FirstMidName" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">true</boolProp>
                  <stringProp name="Argument.name">Student.FirstMidName</stringProp>
                  <stringProp name="Argument.value">User${__Random(1000,9999)}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
                <elementProp name="Student.EnrollmentDate" elementType="HTTPArgument">
                  <boolProp name="HTTPArgument.always_encode">true</boolProp>
                  <stringProp name="Argument.name">Student.EnrollmentDate</stringProp>
                  <stringProp name="Argument.value">${__time(yyyy-MM-dd)}</stringProp>
                  <stringProp name="Argument.metadata">=</stringProp>
                </elementProp>
              </collectionProp>
            </elementProp>
          </HTTPSamplerProxy>
          <hashTree>
            <!-- Accept 200 (success) or 302 (redirect after create) -->
            <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert Success or Redirect">
              <collectionProp name="Asserion.test_strings">
                <stringProp name="48690">200</stringProp>
                <stringProp name="51508">302</stringProp>
              </collectionProp>
              <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
              <intProp name="Assertion.test_type">40</intProp>
            </ResponseAssertion>
            <hashTree/>
            
            <!-- Duration Assertion: Response under 3 seconds for writes -->
            <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Assert Response Time < 3s">
              <stringProp name="DurationAssertion.duration">3000</stringProp>
            </DurationAssertion>
            <hashTree/>
          </hashTree>
          
          <!-- Post-submit think time -->
          <UniformRandomTimer guiclass="UniformRandomTimerGui" testclass="UniformRandomTimer" testname="Post Submit Think Time">
            <stringProp name="ConstantTimer.delay">1000</stringProp>
            <stringProp name="RandomTimer.range">2000</stringProp>
          </UniformRandomTimer>
          <hashTree/>
        </hashTree>

        <!-- ============================================================ -->
        <!-- Throughput Controller: 60% Browse, 40% Create -->
        <!-- ============================================================ -->
        <!-- Note: The scenarios above run sequentially. For weighted distribution,
             wrap in a Throughput Controller or use Weighted Switch Controller -->
        
      </hashTree>
      
      <!-- ============================================================ -->
      <!-- Summary Report Listener (disabled by default for Azure Load Testing) -->
      <!-- ============================================================ -->
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      
    </hashTree>
  </hashTree>
</jmeterTestPlan>